//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//
// @file  OptionRomPolicy.uni
//
// String definitions for the OptionRomPolicy
//

/=#
#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"      // AMI Mapping Language

#string STR_EMPTY                       #language en-US ""
#string STR_ENABLED                     #language en-US "Enabled"
#string STR_DISABLED                    #language en-US "Disabled"
#string STR_NONE                        #language en-US "None"
#string STR_AUTO                        #language en-US "Auto"

#string STR_ROM_PCI_DRIVER_VER_PROMPT   #language en-US "AMI ROM Dispatch Policy : "
#string STR_ROM_PCI_DRIVER_VER          #language en-US "00.00"

#string STR_ROM_FORM                    #language en-US "Option ROM Dispatch Policy"
#string STR_ROM_LIST_SUBTITLE           #language en-US "Device Class Option ROM Dispatch Policy:"
#string STR_ROM_LIST_SUBTITLE1          #language en-US "(Used when Group Policy set to 'Custom')"

#string STR_ROM_WARNING1                #language en-US "WARNING: Changing Device(s) Option ROM"
#string STR_ROM_WARNING2                #language en-US "dispatch policy may affect system’s ability" 
#string STR_ROM_WARNING3                #language en-US "to post and/or boot!PROCEED WITH CAUTION!"


#string STR_ROM_VGA_SUPRESS_PROMPT      #language en-US "Primary Video Ignore"
                                        #language x-UEFI-AMI "OROM001"
#string STR_ROM_VGA_SUPRESS_HELP        #language en-US "If software will detect that due to the Policy settings, Option ROM of Primary Video Device will not dispatch, it will ignore this device policy settings, and restore it to 'Enable' automatically."
                                                             
#string STR_ROM_RESET_POLICY_PROMPT     #language en-US "Restore if Failure"
                                        #language x-UEFI-AMI "OROM002"
#string STR_ROM_RESET_POLICY_HELP       #language en-US "If system fails to boot and this option is set to 'Enabled', software will reset settings of this page as well as CSM page to its default values automatically."

#string STR_ROM_OPTION_HELP             #language en-US "Enable or Disable Option ROM execution for selected Slot."
#string STR_ROM_ITEM_HELP_ONBOARD       #language en-US "Onboard Device has:\n UEFI   [%s]\n Legacy [%s]\nEmbedded ROM(s).\nVIDx%X;DIDx%X\n@ s%d|Bx%X|Dx%X|Fx%X"
#string STR_ROM_ITEM_HELP_SLOT_HAVE     #language en-US "Device on Slot has:\n UEFI   [%s]\n Legacy [%s]\nOption   ROM(s).\nVIDx%X;DIDx%X\n@ s%d|Bx%X|Dx%X|Fx%X"
#string STR_ROM_ITEM_HELP_SLOT_DONT     #language en-US "Device on Slot does not have an Option ROM."
//#string STR_ROM_ITEM_HELP_LOCATION      #language en-US "VID(x%X) DID(x%X)\n@ S%d|Bx%X|Dx%X|Fx%X"


//Default policy display strings...
#string STR_ROM_DEFAULT_POLICY_PROMPT1  #language en-US "Device Group Default ROM Policy"
#string STR_ROM_DEFAULT_POLICY_PROMPT2  #language en-US "(Selected at CSM Setup Page)  :" 
#string STR_ROM_DEFAULT_POLICY_PROMPT3  #language en-US "(CSM not Active) - 'UEFI' used:" 

#string STR_ROM_NETWORK_CLASS           #language en-US "Network Class"
#string STR_ROM_STORAGE_CLASS           #language en-US "Mass Storage Class"
#string STR_ROM_DISPLAY_CLASS           #language en-US "Display Class" 
#string STR_ROM_OTHER_CLASS             #language en-US "Other Devices" 

#string STR_ROM_NETWORK_POLICY_UEFI     #language en-US "Network Class      :  UEFI" 
#string STR_ROM_STORAGE_POLICY_UEFI     #language en-US "Mass Storage Class :  UEFI" 
#string STR_ROM_DISPLAY_POLICY_UEFI     #language en-US "Display Class      :  UEFI" 
#string STR_ROM_OTHER_POLICY_UEFI       #language en-US "Other Devices      :  UEFI" 

#string STR_ROM_NETWORK_POLICY_LEGACY   #language en-US "Network Class      :  Legacy" 
#string STR_ROM_STORAGE_POLICY_LEGACY   #language en-US "Mass Storage Class :  Legacy" 
#string STR_ROM_DISPLAY_POLICY_LEGACY   #language en-US "Display Class      :  Legacy" 
#string STR_ROM_OTHER_POLICY_LEGACY     #language en-US "Other Devices      :  Legacy" 


//----------------------------------------------------------------------
//Strings We are going to Assemble goto control and 
//PCI Device Subtitle messages. Needed to support localization.
#string STR_DEVICE_STR                  #language en-US "Device  "
#string STR_SLOT_STR                    #language en-US "Slot"
#string STR_ONBOARD_STR                 #language en-US "On Board"
#string STR_POPULATED_STR               #language en-US "Occupied"
#string STR_EMPTY_STR                   #language en-US "Empty   "
#string STR_NOT_PRESENT_STR             #language en-US "NOT FOUND"
#string STR_DISABLE_STR                 #language en-US "Disable OPROM"
#string STR_UEFI_STR                    #language en-US "UEFI OPROM"
#string STR_LEGACY_STR                  #language en-US "Legacy OPROM"
#string STR_CUSTOM_STR                  #language en-US "Custom"
#string STR_DISABLE_ALL_STR             #language en-US "Disable All"

//----------------------------------------------------------------------
#string STR_ROM_HELP_NETWORK_BEHIND     #language en-US "Network Device behind the bridge."
#string STR_ROM_HELP_STORAGE_BEHIND     #language en-US "Mass Storage Device behind the bridge."
#string STR_ROM_HELP_DISPLAY_BEHIND     #language en-US "Display Device behind the bridge."
#string STR_ROM_HELP_OTHER_BEHIND       #language en-US "Other Device behind the bridge."

//----------------------------------------------------------------------
#string STR_PCI_CLAS_00_STR             #language en-US "Old PCI Device"
#string STR_PCI_CLAS_01_STR             #language en-US "Mass Storage Controller"
#string STR_PCI_CLAS_02_STR             #language en-US "Network Controller"
#string STR_PCI_CLAS_03_STR             #language en-US "Display Controller"
#string STR_PCI_CLAS_04_STR             #language en-US "Multimedia Device"
#string STR_PCI_CLAS_05_STR             #language en-US "Memory Controller"
#string STR_PCI_CLAS_06_STR             #language en-US "Bridge Device"
#string STR_PCI_CLAS_07_STR             #language en-US "Simple Comm. Controller"
#string STR_PCI_CLAS_08_STR             #language en-US "Base System Peripherals"
#string STR_PCI_CLAS_09_STR             #language en-US "Input Device"
#string STR_PCI_CLAS_0A_STR             #language en-US "Docking Station"
#string STR_PCI_CLAS_0B_STR             #language en-US "Processor"
#string STR_PCI_CLAS_0C_STR             #language en-US "Serial Bus Controller"
#string STR_PCI_CLAS_0D_STR             #language en-US "Wireless Controller"
#string STR_PCI_CLAS_0E_STR             #language en-US "Intelligent I/O Controller"
#string STR_PCI_CLAS_0F_STR             #language en-US "Satellite Comm. Controller"
#string STR_PCI_CLAS_10_STR             #language en-US "En/Decryption Controller"
#string STR_PCI_CLAS_11_STR             #language en-US "Data Acquisition Controller"
#string STR_PCI_CLAS_UNKNOWN_STR        #language en-US "Unknown Class"

//----------------------------------------------------------------------

#string STR_ROM_OTHER_CLASS_HELP        #language en-US "Determines OpROM execution policy for devices other than Network, Storage, or Video"
#string STR_ROM_DISPLAY_CLASS_HELP      #language en-US "Controls the execution of UEFI and Legacy Video OpROM"
#string STR_ROM_STORAGE_CLASS_HELP      #language en-US "Controls the execution of UEFI and Legacy Storage OpROM"
#string STR_ROM_NETWORK_CLASS_HELP      #language en-US "Controls the execution of UEFI and Legacy Network OpROM"



//#string STR_PCI_DRIVER_VER              #language en-US "00.00"

//#string STR_1G                          #language en-US "1 G" 
//#string STR_1G                          #language en-US "1 G" 
//#string STR_1G                          #language en-US "1 G" 



//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************